[
    {
        "year": "2022",
        "events": [
            {
                "name": "Best Student Project Award 2022",
                "description": "The Best Student Project Award was held on05th November 2022. The guest speaker was Mr Muhammad Yazar, alumnus of NITC who currently works at Facebook, Seattle, USA. He spoke about the numerouscareer options available to students post their B.Tech degree. In addition to this, he spoke about the procedure for securing admission to universities abroad along with the chance of direct admission for P.h.D. After the session, the winning team for the best CSE B.Tech project was announced. The winners received a cash prize of Rs. 5000 and a certificate of appreciation."
            },
            {
                "name": "Git Workshop",
                "description": "CSEA in collaboration with FOSSCell, NITC organized a Git Workshopon 13th October, 2022 as a part of Hacktoberfest. The workshop focussed on the basics of the version control system, Git. Additionally, the session motivated participants to explore the world of open-source software so that they can start contributing themselves."
            },
            {
                "name": "Coding With Seniors (CWS) 2022",
                "description": "The 2022 edition of Coding with Seniors had its introductory session for the B21 batch held on 6th November, 2022. The session focussed on introducing the present second-year CSE students to the benefits of CWS, such as access to doubt-clearing sessions, mock coding tests, study materials etc. They will be organised into groups, after which mentors will be assigned to each group."
            },
            {
                "name": "CSEA Activities Inauguration for Monsoon 2022",
                "description": "A one-hour long informative webinar titled “Something for almost nothing: a gentle introduction to sublinear time algorithms” by Mr Nithin Verma, Assistant Professor, Computer Science Department at Chennai Mathematical Institute, took place on September 2, 2022. The webinar explored the sublinear computation paradigm to tackle big data challenges with real-life examples. This was followed by insights into solving non-trivial problems in sublinear-time and efficient algorithms to test the correctness of the graph. The webinar was aimed at the cruciality of rethinking conventional notions of efficient algorithms used to manage and analyze modern datasets that revolve around billions of inputs. The Webex session concluded with questions from the attendees. This webinar marked the beginning of the activities of CSEA for this monsoon semester."
            },
            {
                "name": "CSEA Orientation for B21 Batch",
                "description": "This was conducted on 8th August 2022. The CSEA secretary gave an overview of the various sub-domains in the field of computer science. The WebMaster of CSEA gave more insights into the numerous activities coordinated by CSEA. This session concluded with an interactive Q&A session between the juniors and CSEA executives."
            },
            {
                "name": "Interview Diaries ‘22",
                "description": "This is an ongoing initiative. For this year’s issue, three editions have been posted so far."
            },
            {
                "name": "CSEA Inauguration for Winter Semester 2022",
                "description": "The CSEA activities for the newsemester were inaugurated by Mr Karthik Raghunathan, Director of Machine Learning of CISCO on 16th February 2022. He gave a talk on using MindMeld: an open-source AI platform for a production-level conversational interface. The two-hour session covered the mindmap to build a voice assistant and associated features using open-source AI assets."
            }
        ]
    },
    {
        "year": "2021",
        "events": [
            {
                "name": "Interview Diaries",
                "description": "This sough-after initiative by CSEA has helped numerous students with the pangs of anxiety over facing the interview desk for the first time. The Interview Diaries ‘21 gave complete coverage of a wide array of companies and their testing patterns. A total of 27 companies were published in this issue."
            },
            {
                "name": "Best Student Project Award",
                "description": "This was held on 12th November 2021. The guest speaker Ms Devika S, SDE at Adobe Inc Digital Experience, gave a walkthrough of her journey in the software engineering realm. An abstract of the best project was delivered by the winning team."
            },
            {
                "name": "ReactJS Webinar",
                "description": "This was a one-hour interactive webinar by Ms Shahda Sayed, an alumnus from the batch of 2008 who works as a front-end developer at Microsoft. This was held on 16th October 2021. This session encapsulated the advantages of&nbsp; ReactJS, the differences between libraries and frameworks, JS bundling and transpiling."
            },
            {
                "name": "Hacktoberfest Git Workshop",
                "description": "Hacktoberfest, a month-long open-source annual event run by DigitalOcean, was celebrated by the FOSSCell of NITC, along with CSEA. This was inaugurated with a session on Git by the secretary of FOSSCell, on 13th October 2022. The session began with an introduction to Hacktoberfest and insights on open-source development. Later on, the attendees were introduced to Git and its features. A walk-through on the installation procedure across numerous operating systems enabled all the participants to follow along. After this, numerous commands and their effects were shown live, giving beginners a clear idea of how to work with git. The session concluded with a demo on how to make contributions to the Hacktoberfest."
            },
            {
                "name": "Coding With Seniors (CWS) 2021",
                "description": "CWS was initiated with the aim to build a solid base in development and coding through interactive sessions conducted by the pre-final year students. The first session was held on 29th September 2021. Apart from the bi-weekly sessions, groups of 5-6 students were formed and assigned mentors for constant guidance."
            },
            {
                "name": "Code.Init() 2021",
                "description": "This hackathon was conducted in collaboration with FOSSCell of NITC between 24-26th September 2021. With the sponsorship from GitHub, this hackathon received an overwhelming participation of nearly 100 students and more than 20 mentors. A wide range of problems pertaining to the campus was presented before the participants to develop solutions in 24 hours. The top 3 coveted positions received prize money and goodies from GitHub."
            },
            {
                "name": "CSEA Inauguration for Monsoon Semester 2021",
                "description": "The inauguration of CSEA activities for the academic year 2021-2022 was held on 16th August 2021 via Cisco Webex. Mr Manoj N Palat, open-source lead at IBM and a NITC alumnus, served as the chief guest for the event. Following the inaugural ceremony, Mr Palat gave a talk on cloud and open source from an industry perspective as a part of the 10th lecture in the M.N.Neelakantan Memorial lecture series. The talk included many easy-to-follow tips and resources for students to make use of open source and cloud."
            },
            {
                "name": "Workshop on Git and GitHub by IncubatedIND",
                "description": "This workshop was conducted by CSEA in partnership with IncubatedIND on 23rd February 2021. Mr Kaushik Roy, Principal Architect of IncubatedIND led this interactive session covering all the essential Git comments. A hands-on session enabled the students to go deeper into each of these commands and their functionalities."
            },
            {
                "name": "CWS - Basics of Linux and Git",
                "description": "This workshop was held on 23rd January 2021 under the pretext of ‘Coding With Seniors’ wing of CSEA. It was headed by Faris Shajahan, an NITC alumnus who is currently working in Oracle."
            }
        ]
    },
    {
        "year": "2020",
        "events": [
            {
                "name": "CodeOverflow #1.3",
                "description": "This coding contest was conducted in coordination with CPHub on 15th November 2020 via Codechef. There was active participation across various years of study and branches of our institute. The contest went on for 4 hours and the top 5 winners were awarded prizes worth Rs. 4000."
            },
            {
                "name": "Introduction to CSEA and FOSSCell",
                "description": "The introductory session for the batch of 2020 was held on 10th October 2020 by the CSEA and FOSSCell executives."
            },
            {
                "name": "Coding With Seniors",
                "description": "CWS 2020 edition began on 11th October 2020."
            },
            {
                "name": "Interview Diaries",
                "description": "Interview Diaries 2020 started on 26th August 2020 and wrapped up by 7th October 2020. Eight issues were released featuring 35 companies."
            },
            {
                "name": "CSEA Inauguration - Pros and Cons of Flipped Classrooms",
                "description": "The inauguration of the CSEA activities for the Monsoon Semester 2020 took place on 11th September 2020. The keynote address was given by Dr Rajkumar S. Pant, Professor of Aerospace Engineering Department IIT Bombay. The session focussed on the importance of engaging students in the content and encouraging self-learning."
            },
            {
                "name": "Flutter Workshop",
                "description": "A flutter workshop was held on 7th-8th March 2020. The event covered the basics of the software framework and successfully assisted the participants in developing a basic mobile application."
            },
            {
                "name": "DevSprint - Code.Init() 2020",
                "description": "FOSSCell in collaboration with CSEA conducted Code.Init() on 25th and 26th January 2020. The initiative was taken up to sow the seeds of open source development in campus. The event was open to all branches and years of study. Code.Init() concluded with the presentation of all the projects developed by the participants."
            }
        ]
    },
    {
        "year": "2019",
        "events": [
            {
                "name": "CSEA Inauguration for Monsoon Semester 2019",
                "description": "The inauguration of CSEA activities for the monsoon semester 2019 took place on 18th September 2019. The keynote address was given by Mr Raveendran Kasthuri, CEO of ULCCS group, Calicut. The event had a panel discussion on Industry-Institute Collaboration: An opportunity."
            },
            {
                "name": "Artificial Neural Network Workshop",
                "description": "Open Tech, in association with CSEA, organised a workshop on artificial neural network from 26th August to 5th September 2019 for the first year students. The workshop covered the basics of python, tensorflow, keras and other tools to develop a neural network."
            }
        ]
    },
    {
        "year": "2014-2015",
        "events": [
            {
                "name": "CodeMaestros",
                "description": "Series of coding competitions to improve the coding skills of NITC Students."
            },
            {
                "name": "Talk on Parallel Computing and Formal Methods",
                "description": "A special talk on Parallel Computing and Formal Methods by Professor Ganesh L Gopalakrishnan from the University of Utah."
            },
            {
                "name": "Talk on Diaspora",
                "description": "A special talk on Diaspora by Mr. Praveen, NITC alumnus."
            },
            {
                "name": "Google Developers Group Devfest",
                "description": "First-ever Devfest organized at Kozhikode."
            },
            {
                "name": "Placement Talk",
                "description": "Conducted by fourth-year students for third-year students."
            },
            {
                "name": "Android Workshop",
                "description": "in association with IT@NIRAVU to impart knowledge on basic app development on Jan 23,2015."
            },
            {
                "name": "Hands-on Sessions in C++",
                "description": "Organized for first-year CSE students."
            },
            {
                "name": "Python Workshop",
                "description": "Small-scale workshop for Python beginners."
            },
            {
                "name": "Talk on Big Data Analytics",
                "description": "Delivered by Noufal Gosali, head of Big Data at TCS in March 2015."
            }
        ]
    },
    {
        "year": "2011-2012",
        "events": [
            {
                "name": "Software Freedom Day",
                "description": "Celebration of Software Freedom Day on September 17, 2011 during which a workshop on GNU/Linux and shell scripting was conducted for the second year CS students."
            },
            {
                "name": "Drupal Workshop",
                "description": "A small scale workshop was conducted to help the students learn new vistas of web development."
            },
            {
                "name": "Code Maestros",
                "description": "the annual and the most influential open coding event of NIT Calicut. It had two rounds and the finalists were given a workshop on Python for the final round conducted on Feb 11, 2012."
            },
            {
                "name": "Webinar on Higher Studies",
                "description": "by Karthik Raghunathan, an alumnus of CSED NIT Calicut and Stanford University, presently working at Microsoft Corp., Redmond, USA, was organized for interested students on Feb 22, 2012."
            }
        ]
    },
    {
        "year": "2010-11",
        "events": [
            {
                "name": "WebEx lecture on Cloud Computing",
                "description": "A WebEx lecture on Cloud Computing conducted on November 1st, 2010 by Supriya Kannery, Advisory Software Engineer, India Software Labs, IBM, Bangalore."
            },
            {
                "name": "A talk on \"The future of Internet - How to live, love and win in a networked world\" ",
                "description": "A talk on Cloud Computing conducted on November 1st, 2010 by Supriya Kannery, Advisory Software Engineer, India Software Labs, IBM, Bangalore.by Joseph Sirosh, Vice president of the e-commerce platform group (ECPG). for Amazon worldwide, who also leads Business Intelligence (BI), Transaction and Risk Management Services (TRMS) group at Amazon, was conducted on August 3, 2010."
            }
        ]
    }
]
